tap "teamookla/speedtest"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line fuzzy finder written in Go
brew "fzf"
# Improved top (interactive process viewer)
brew "htop"
# Handy way to save and run project-specific commands
brew "just"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Modern Python package and dependency manager supporting the latest PEP standards
brew "pdm"
# Soak up standard input and write to a file
brew "sponge"
# Non-interactive SSH password auth
brew "sshpass"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"

# Utilities designed to make common development tasks easier
cask "devtoys"
# Collaborative team software
cask "figma"
# Change the behavior of the fn keys depending on the active application
cask "fluor"
# Jetbrains font
cask "font-jetbrains-mono-nerd-font"
# Menu bar manager
cask "jordanbaird-ice"

# GPU-based terminal emulator
cask "kitty"
# Kubernetes IDE
cask "lens"
# File system integration
cask "macfuse"
# Online collaborative whiteboard platform
cask "miro"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# IDE for professional Python development
cask "jetbrains-toolbox"
# Transmission remote GUI
cask "transmission-remote-gui"
# Network protocol analyzer
cask "wireshark"
# HTML to PDF renderer
cask "wkhtmltopdf"
# Fast terminal app
cask "alacritty"
